<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"bc5ddbc4ee522b0af280cd089c7f9cda8530cada2755dd1ca60371c9365e8f94","plan_job_ref":"Job Terraform Plan #99 at https://github.com/ironashram/kub1k/actions/runs/11985129012","plan_out_hash":"08aac0dd77c740042e9a6348174f5fe51578f6c325a378605b85865099aa9482","plan_hash":"2e27a4d0160f2b68d9d6a6b3f4be0e3c81fb1a0ab2310040aa99d2cb8fb88694","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.cert_manager will be updated in-place
!~  resource "helm_release" "cert_manager" {
        id                         = "cert-manager"
        name                       = "cert-manager"
!~      version                    = "v1.16.1" -> "v1.16.2"
#        (27 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-11-16T17:47:12Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #99](https://github.com/ironashram/kub1k/actions/runs/11985129012)